# 我们定义只由 5和 8 两个数字组成的整数，并按照从小到大的顺序进行排序。并为每个特殊数字分配一个从1递增的序号，
# 例如：5、8、55、58、 85、 88、555、558、585、…，对应的序号为：1、2、3、4、5、6、7、8、9…。
# 按照上述规则，我们可以输入任意一个序号数字，即可输出对应的由 5和 8 组成的特殊整数。

# 请写出完整的代码。要求输入序号 （最大为 10的 10次方），输出序号对应的特殊整数。
# 示例：
# 输入：[3, 14, 100]
# 输出：[55, 88, 855858]


def sort58(x):
    dp = ["5", "8", "55", "58"]
    if x < 4:
        return int(dp[x])
    else:
        for p in range(4, x):
            s = dp[-1]
            if len(dp) % 10000000 == 0:
                dp = dp[-100:]
            if s[-1] == "5":
                dp.append(s[:-1] + "8")
                continue
            for i in range(len(s)-2, -1, -1):
                if s[i] == "5":
                    dp.append(s[:i]+"8"+"5"*(len(s)-i-1))
                    break
            else:
                dp.append("5"*(len(s)+1))
                continue
    return int(dp[-1])


print(sort58(100000000))